[
    {
        "title": "The First Vision",
        "img_url": "https://assets.churchofjesuschrist.org/d8/cc/d8cc7c06d5a2bb9a8ebd70380bab254ac7438b8f/first_vision_indonesian_folk_art.jpeg",
        "descr": "“I saw a pillar of light exactly over my head, above the brightness of the sun, which descended gradually until it fell upon me. When the light rested upon me I saw two Personages, whose brightness and glory defy all description, standing above me in the air. One of them spake unto me, calling me by name and said, pointing to the other—This is My Beloved Son. Hear Him!”"
    },
    {
        "title": "The Angel Moroni",
        "img_url": "https://assets.churchofjesuschrist.org/2a/b1/2ab1e5d1da7510200cd39088c4fb86cf6ce9811c/angel_moroni_delivering_the_plates_to_joseph_smith.jpeg",
        "descr": "In 1823 an angel named Moroni appeared to Joseph Smith and told him of the existence of an ancient record engraved on plates, buried in a hill near his home. Moroni, the last ancient record keeper to inscribe his teachings on the plates, appeared to Joseph on a number of occasions between 1823 and 1829, guiding and mentoring Joseph as he obtained the plates and translated them. Though others produced fanciful or sensationalized accounts of the angel’s visits, Joseph Smith’s own accounts are simple, sober, and consistent. Joseph’s preparation to become a prophet began with his First Vision, but his early followers typically spoke of Moroni’s visit as marking the beginning of Joseph’s calling."
    },
    {
        "title": "The Gold Plates",
        "img_url": "https://assets.churchofjesuschrist.org/1e/34/1e34564bee1944096903da0d118509c511f5525b/replica_gold_plates.jpeg",
        "descr": "“At length the time arrived for obtaining the plates, the Urim and Thummim, and the breastplate. On the twenty-second day of September, one thousand eight hundred and twenty-seven, having gone as usual at the end of another year to the place where they were deposited, the same heavenly messenger delivered them up to ame with this charge: that I should be responsible for them; that if I should let them go carelessly, or through any neglect of mine, I should be cut off; but that if I would use all my endeavors to preserve them, until he, the messenger, should call for them, they should be protected.”"
    },
    {
        "title": "Book of Mormon",
        "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQezjWBAdhINCeWsQhfX_0kb6F2Azp8-nugmDl8CzSWQeGmO31klKM-rudo8Ak9WTZavo0&usqp=CAU",
        "descr": "Joseph began translating again in 1829, and almost all of the present Book of Mormon text was translated during a three-month period between April and June of that year. His chief scribe during these months was Oliver Cowdery, a schoolteacher from Vermont who learned about the Book of Mormon while boarding with Joseph’s parents in Palmyra."
    },
    {
        "title": "Restoration of the Priesthood",
        "img_url": "https://assets.churchofjesuschrist.org/f3/16/f316e1d65be085cc95dfcb62cdd24bee572a03d8/restoration_melchizedek_priesthood.jpeg",
        "descr": "While Joseph Smith and Oliver Cowdery were working on the translation of the Book of Mormon, they read about baptism for the remission of sins. On May 15, 1829, they went to a wooded area near Joseph’s home in Harmony, Pennsylvania, and prayed about what they had learned. In answer to their prayer, John the Baptist, under the direction of the Lord Jesus Christ, appeared and conferred upon them the Aaronic Priesthood."
    },
    {
        "title": "The Kirtland Temple",
        "img_url": "https://assets.churchofjesuschrist.org/e2/ca/e2ca3391e9f8cef8a553e869a5c2c234a44a4b95/jesus_christ_kirtland_temple_parsons.jpeg",
        "descr": "In a revelation received on December 27 and 28, 1832, the Lord commanded the Saints to build a temple in Kirtland, Ohio. Referring to this commandment, the Prophet Joseph Smith wrote: “This is the word of the Lord to us, and we must, yea, the Lord helping us, we will obey: as on conditions of our obedience He has promised us great things; yea, even a visit from the heavens to honor us with His own presence”"
    },
    {
        "title": "Church Persecution",
        "img_url": "https://assets.churchofjesuschrist.org/6791cd56e7da48c83816ac3102068e78494c5469",
        "descr": "A few of those in Kirtland who had left the Church sought to kill Joseph Smith. Warned by the Lord in a revelation, he and Sidney Rigdon left during the night and traveled to Far West, Missouri, arriving in March 1838. During the summer and fall of that year, misunderstandings and tensions between the Missourians and Church members led to armed conflict in northern Missouri. Relying on exaggerated reports of this conflict, the Missouri governor issued an extermination order to drive the Saints from the state by force. Shortly after this, in November 1838, the Prophet Joseph Smith and other Church leaders were arrested, falsely charged with treason against the state, and eventually imprisoned in Liberty Jail in Clay County, Missouri."
    },
    {
        "title": "Redemption of the Dead",
        "img_url": "https://assets.churchofjesuschrist.org/42/1b/421b0d75d63439066a40566dad1582fb17c73564/beyond_the_veil.jpeg",
        "descr": "Joseph “marveled” at seeing his brother Alvin in the celestial kingdom because Alvin had not been baptized. Four years later, in August 1840, the Prophet began teaching the Saints the doctrine of baptism for the dead. The Apostle Paul had taught this doctrine in the New Testament before the Lord restored it in our day"
    },
    {
        "title": "Plural Marriage",
        "img_url": "https://assets.churchofjesuschrist.org/dc/95/dc958aac663f4150e6c18a888b5cc56906b0e483/abraham_praying_grant_clawson.jpeg",
        "descr": "Beginning in 1841, the Prophet Joseph Smith married additional women in obedience to the Lord’s commandment and introduced the principle of plural marriage to a limited number of other Church members."
    },
    {
        "title": "Martyrdom of Joseph Smith",
        "img_url": "https://assets.churchofjesuschrist.org/a7/9d/a79d4677789d5aa10b58d466aca873641f398e55/joseph_smith_kirtland.jpeg",
        "descr": "To seal the testimony of this book and the Book of Mormon, we announce the martyrdom of Joseph Smith the Prophet, and Hyrum Smith the Patriarch. They were shot in Carthage jail, on the 27th of June, 1844, about five o’clock p.m., by an armed mob—painted black—of from 150 to 200 persons. Hyrum was shot first and fell calmly, exclaiming: I am a dead man! Joseph leaped from the window, and was shot dead in the attempt, exclaiming: O Lord my God! They were both shot after they were dead, in a brutal manner, and both received four balls. DC 135:1"
    }
]